/* 
  Localizable.strings (简体中文)
  NextFrameX
*/

/* Menu Items */
"menu.settings" = "设置";
"menu.language" = "语言";
"menu.language.system" = "跟随系统";
"menu.language.english" = "English";
"menu.language.chinese" = "简体中文";
"menu.processing.preferences" = "处理偏好…";
"menu.performance.mode" = "性能模式";
"menu.iap.toggle" = "IAP内购";
"menu.clear.cache" = "清空缓存";
"menu.terms" = "使用条款";
"menu.privacy" = "隐私政策";

/* Common */
"common.ok" = "确定";
"common.cancel" = "取消";
"common.confirm" = "确认";
"common.delete" = "删除";
"common.save" = "保存";
"common.load" = "加载";
"common.export" = "导出";
"common.import" = "导入";

/* Alerts */
"alert.language.changed" = "语言已更改";
"alert.language.changed.message" = "语言已更改。请重启应用以使更改完全生效。";

/* Settings */
"settings.title" = "设置";
"settings.language" = "语言";
"settings.language.description" = "选择应用程序语言";

/* Performance Mode */
"performance.mode.enabled" = "性能模式已开启";
"performance.mode.disabled" = "性能模式已关闭";
"performance.mode.enabled.message" = "预览分辨率已降低至 2048px，以提升处理性能。\n\n下次加载图片时将生效。";
"performance.mode.disabled.message" = "预览分辨率已恢复至 4096px。\n\n下次加载图片时将生效。";

/* Purchase Mode */
"purchase.mode.changed" = "购买方式已切换";
"purchase.mode.iap.message" = "已切换到 IAP 内购模式。\n\n点击购买状态条将弹出苹果内购弹窗。";
"purchase.mode.activation.message" = "已切换到激活码模式。\n\n点击购买状态条将弹出激活码输入弹窗。";

/* Cache */
"cache.clear.title" = "清空缓存";
"cache.clear.message" = "将清空历史图片参数，下次导入将重新计算。\n\n预估缓存体积：%@\n\n请选择要清理的时间范围：";
"cache.clear.today" = "今天";
"cache.clear.week" = "1周内";
"cache.clear.month" = "1个月内";
"cache.clear.all" = "全部";
"cache.cleared" = "缓存已清空";
"cache.cleared.message" = "缓存已成功清空。";

/* IAP Purchase */
"iap.purchase.title" = "购买套餐";
"iap.subscription.title" = "订阅套餐";
"iap.subscription.description" = "订阅期间内可无限次导出。订阅将自动续订，除非在 App Store 设置中取消。";
"iap.no.products" = "暂无可用套餐";
"iap.reload" = "重新加载";
"iap.purchase.button" = "购买";
"iap.subscription.period" = "订阅周期：%@";
"iap.subscription.unlimited" = "订阅期间内可无限次导出";
"iap.subscription.per.period" = "每%@";
"iap.subscription.period.day" = "%d天";
"iap.subscription.period.week" = "%d周";
"iap.subscription.period.month" = "%d个月";
"iap.subscription.period.year" = "%d年";
"iap.subscription.period.cycle" = "%d个周期";

/* Toolbar */
"toolbar.rotate.counterclockwise" = "逆时针旋转90度";
"toolbar.rotate.counterclockwise.mirrored" = "顺时针旋转90度（镜像开启）";
"toolbar.rotate.clockwise" = "顺时针旋转90度";
"toolbar.rotate.clockwise.mirrored" = "逆时针旋转90度（镜像开启）";
"toolbar.mirror.horizontal" = "水平镜像（左右翻转）";
"toolbar.crop.cancel" = "取消";
"toolbar.crop.auto" = "自动裁切";
"toolbar.crop.auto.help" = "将智能范围的边界设为裁切框范围";
"toolbar.crop.reset" = "复位";
"toolbar.crop.confirm" = "完成";
"toolbar.crop.mode" = "裁切模式";
"toolbar.crop" = "裁切";
"toolbar.export" = "导出";
"thumbnail.list.export" = "导出";
"thumbnail.list.export.batch" = "批量导出";

/* Thumbnail List */
"thumbnail.list.title" = "图片列表";
"thumbnail.list.selected" = "已选 %d";
"thumbnail.list.importing" = "正在导入: %d/%d";
"thumbnail.list.remove" = "移除";
"thumbnail.list.load.failed" = "加载失败";
"thumbnail.list.import" = "导入";
"thumbnail.list.environment.switched" = "已切换到：%@\n\n提示：长按导入按钮3秒可切换环境";
"environment.switched.title" = "环境切换";

/* Adjustment Panel */
"adjustment.panel.title" = "调整面板";
"adjustment.panel.auto" = "自动";
"adjustment.panel.reset" = "还原";
"adjustment.panel.processing" = "处理中...";
"adjustment.panel.smart.range" = "智能范围";
"adjustment.panel.detecting" = "检测中";
"adjustment.panel.manual.selection" = "手动框选";
"adjustment.panel.invert" = "反相";
"adjustment.panel.color.cast.removal" = "色偏去除";
"adjustment.panel.style.boost" = "风格增强";
"adjustment.panel.auto.adjust" = "自动调整";
"adjustment.panel.color" = "色彩";
"adjustment.panel.contrast" = "对比度";
"adjustment.panel.min.value" = "最小值:";
"adjustment.panel.max.value" = "最大值:";
"adjustment.panel.temperature.tint" = "色温色调";
"adjustment.panel.auto.detect" = "自动检测";
"adjustment.panel.temperature" = "色温";
"adjustment.panel.tint" = "色调";
"adjustment.panel.reset.whitebalance.help" = "复位白平衡";
"adjustment.panel.basic.adjustment" = "基础调整";
"adjustment.panel.exposure" = "曝光";
"adjustment.panel.shadows" = "阴影";
"adjustment.panel.highlights" = "高光";
"adjustment.panel.reset.basic.help" = "基础调整整体重置";

/* Histogram */
"histogram.range" = "范围";
"histogram.average" = "平均值";
"histogram.peak" = "峰值";
"histogram.soft" = "柔和";
"histogram.balanced" = "平衡";
"histogram.strong" = "强烈";
"histogram.channel.red" = "红";
"histogram.channel.green" = "绿";
"histogram.channel.blue" = "蓝";
"histogram.channel.rgb" = "RGB";
"histogram.channel.stats" = "%@通道统计";
"histogram.levels.black" = "B";
"histogram.levels.mid" = "中";
"histogram.levels.white" = "W";
"histogram.reset.channel.help" = "重置当前通道";
"histogram.color.cast.toggle" = "色偏";
"histogram.color.cast.help" = "启用色偏矫正";
"histogram.brightness.toggle" = "亮度";
"histogram.brightness.help" = "启用亮度修复";
"whitebalance.region.shadows" = "阴影";
"whitebalance.region.midtones" = "中间调";
"whitebalance.region.highlights" = "高光";
"whitebalance.region.overall" = "整体";

/* Image Preview */
"preview.raw.suggestion" = "建议：使用 Adobe DNG Converter 将 RAW 文件转换为 DNG 格式以获得更好的兼容性";
"preview.hint.select.border" = "按 A 框选胶片边框内的区域，就可以去色罩";
"preview.hint.adjust.range" = "按 < > 可以快速调整识别范围";
"preview.hint.adjust.style" = "按 [ ] 可以调整去色罩的风格";
"preview.hint.auto.whitebalance" = "按 W 可以自动白平衡";
"preview.hint.auto.adjust" = "按 S 自动调整对比度和色彩";
"preview.hint.crop.mode" = "按 F 进入裁切模式";
"preview.hint.auto.crop" = "按 D 自动裁切识别范围";
"preview.hint.preserve.effect" = "按 R 可以看看保留偏色/亮度的效果";
"preview.hint.copy.params" = "复制参数：Command+C，粘贴：Command+V";
"preview.hint.rotate" = "方向键 ← → 旋转照片";
"preview.hint.remove.image" = "按 X 可以移除图片";
"preview.hint.raw.to.dng" = "不支持的Raw文件可以转为DNG再导入";
"preview.hint.wish" = "希望你的胶卷永远拍不完";

/* Menu - Account & Update */
"menu.account" = "账户";
"menu.update" = "更新";
"menu.update.check" = "查看更新";

/* Purchase Status */
"purchase.status.not.activated" = "待激活";
"purchase.status.remaining.exports" = "剩余导出 %d 张";
"purchase.status.remaining.days.unlimited" = "剩余 %d 天无限次";
"purchase.status.remaining.days.and.exports" = "剩余%d天无限次+%d次导出";

/* Alerts - Export */
"alert.login.required" = "需要登录";
"alert.login.required.message" = "使用激活码模式导出时需要登录账号才能扣除次数，请先登录后再导出。";
"alert.login.go" = "去登录";
"alert.export.format.title" = "选择导出格式";
"alert.export.format.message" = "请选择要导出的图片格式";
"alert.export.format.tiff" = "TIFF";
"alert.export.format.jpg" = "JPG";
"alert.remove.confirm.title" = "确认移除";
"alert.remove.confirm.multiple" = "确定要移除选中的 %d 张图片吗？";
"alert.remove.confirm.single" = "确定要移除图片「%@」吗？";
"alert.remove.button" = "移除";

/* Account Login */
"account.login.title" = "登录账号";
"account.register.title" = "注册账号";
"account.login.description" = "请登录您的账号以使用激活码功能";
"account.register.description" = "请注册一个新账号以使用激活码功能";
"account.login.switch.to.register" = "没有账号？去注册";
"account.register.switch.to.login" = "已有账号？去登录";
"account.email" = "邮箱";
"account.email.placeholder" = "请输入邮箱";
"account.password" = "密码";
"account.password.placeholder" = "请输入密码（至少6个字符）";
"account.confirm.password" = "确认密码";
"account.confirm.password.placeholder" = "请再次输入密码";
"account.login.button" = "登录";
"account.register.button" = "注册";
"account.error.email.password.required" = "请输入邮箱和密码";
"account.error.confirm.password.required" = "请确认密码";
"account.error.invalid.email" = "邮箱格式不正确";
"account.error.password.too.short" = "密码长度至少6个字符";
"account.error.password.mismatch" = "两次输入的密码不一致";

/* Account Detail */
"account.detail.title" = "账号详情";
"account.detail.username" = "账号名：";
"account.detail.remaining.exports" = "剩余可导出次数：";
"account.detail.used.exports" = "已使用次数：";
"account.detail.total.exports" = "总次数：";
"account.detail.remaining.days" = "剩余有效天数：";
"account.detail.days" = "天";
"account.detail.recover.legacy.title" = "恢复旧版次数";
"account.detail.recover.legacy.description" = "从旧版指纹文件恢复历史充值次数，并绑定到当前账号和设备。";
"account.detail.recover.button" = "恢复次数";
"account.detail.recover.error.not.logged.in" = "请先登录账号再恢复次数";
"account.detail.recover.error.no.fingerprint" = "未找到旧版指纹文件，无法恢复";
"account.detail.recover.error.failed" = "恢复失败，请稍后重试";
"account.detail.recover.success.remaining" = "剩余次数：%@";
"account.detail.recover.success.synced" = "同步激活码 %d 个";
"account.detail.devices.title" = "已激活设备";
"account.detail.devices.empty" = "暂无已激活设备";
"account.detail.devices.current" = "(当前设备)";
"account.detail.devices.last.used" = "最后使用: %@";
"account.detail.devices.hint" = "提示：账号最多可用于 %d 台设备";
"account.detail.close" = "关闭";
"account.detail.logout" = "登出";

/* Version Update */
"version.update.title" = "发现新版本";
"version.update.current" = "当前版本：%@";
"version.update.latest" = "最新版本：%@";
"version.update.message" = "请更新到最新版本以获得更好的体验";
"version.update.later" = "稍后";
"version.update.now" = "立即更新";

/* Processing Preferences */
"processing.preferences.title" = "处理偏好";
"processing.preferences.auto.color.cast" = "自动偏色矫正";
"processing.preferences.auto.brightness" = "自动亮度修复";
"processing.preferences.smart.range.default" = "智能边界默认值：";
"processing.preferences.raw.images" = "RAW 图片";
"processing.preferences.tiff.other.images" = "TIFF / 其他图片";
"processing.preferences.default.color.intensity" = "默认色彩强度：";
"processing.preferences.default.contrast" = "默认对比度：";
"processing.preferences.info.message" = "修改会影响下一次加载或重置图片时的默认状态。";
"processing.preferences.smart.range.disabled" = "关闭";
"processing.preferences.smart.range.smart" = "智能";

/* Export Progress */
"export.progress.title" = "正在导出图片";
"export.progress.progress" = "进度:";
"export.progress.cancel" = "取消";
